; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared3 - mode
	spectrograph2 - mode
	image0 - mode
	thermograph1 - mode
	Star0 - direction
	Star1 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	Star13 - direction
	Star3 - direction
	Star10 - direction
	GroundStation9 - direction
	GroundStation2 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star13)
	(supports instrument1 image0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star10)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Planet14 thermograph1)
	(have_image Phenomenon15 image0)
	(have_image Planet16 thermograph1)
	(have_image Planet17 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 phenomenon15 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 5
3. (turn_to satellite0 star13 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star13)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star13)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 phenomenon15)
   goals met: 0 of 5
6. (take_image satellite0 phenomenon15 instrument0 image0)
   added: (have_image phenomenon15 image0)
   goals met: 1 of 5
7. (turn_to satellite0 planet14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet14)
   goals met: 1 of 5
8. (take_image satellite0 planet14 instrument0 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 2 of 5
9. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 2 of 5
10. (take_image satellite0 planet16 instrument0 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 3 of 5
11. (turn_to satellite0 planet17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet17)
   goals met: 3 of 5
12. (take_image satellite0 planet17 instrument0 image0)
   added: (have_image planet17 image0)
   goals met: 4 of 5
13. (turn_to satellite0 star10 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star10)
   goals met: 5 of 5
